_posts_bak/2022-01-02-boj-3055.html
---
layout: post
title: BOJ 3055 탈출
tags: bfs 그래프
---

<div id="outline-container-org51f6970" class="outline-2">
<h2 id="org51f6970">BOJ 3055 탈출</h2>
<div class="outline-text-2" id="text-org51f6970">
<ul class="org-ul">
<li>물이 계속 차오르고 있을때, 고슴도치가 물을 피해, S에서 D로 이동할 최소시간</li>
</ul>
</div>
</div>

<div id="outline-container-orge524885" class="outline-2">
<h2 id="orge524885">접근하기</h2>
<div class="outline-text-2" id="text-orge524885">
<ul class="org-ul">
<li>BFS로 풀기. 물의 확장을 bfs로 탐색 water_map에 채우기</li>
</ul>
<pre class="example">
water    bebber
0 1 0    3 0 0
3 2 1    2 1 0
4 0 2    1 0 1

- 목적지는 water[y][x] = 0 상태
- water[ny][nx] &gt; bebber[y][x] + 1
   -&gt; 이동할 좌표가 물이 찬 시간 &gt; 비버의 현재시간 + 1  (이 조건을 생각해내는 것이 중요)
</pre>
</div>
</div>


<div id="outline-container-orgbeb74f8" class="outline-2">
<h2 id="orgbeb74f8">코드</h2>
<div class="outline-text-2" id="text-orgbeb74f8">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;cstdio&gt;</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;queue&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">R</span>, <span style="color: #ff6347;">C</span>;

<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">MAX_H</span> 51
<span style="color: #729fcf;">#define</span> <span style="color: #ff6347;">MAX_W</span> 51

<span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">map</span>[MAX_H][MAX_H];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">water</span>[MAX_H][MAX_H];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">bebber</span>[MAX_H][MAX_H];

<span style="color: #729fcf; font-weight: bold;">typedef</span> <span style="color: #729fcf; font-weight: bold;">struct</span> <span style="color: #8ae234; font-weight: bold;">Node</span>
{
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">y</span>;
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">x</span>;
} <span style="color: #8ae234; font-weight: bold;">Node</span>;

<span style="color: #8ae234; font-weight: bold;">queue</span>&lt;<span style="color: #8ae234; font-weight: bold;">Node</span>&gt; <span style="color: #ff6347;">water_q</span>;

<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">start</span>;
<span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">dest</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dy</span>[4] = {1, -1, 0, 0};
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">dx</span>[4] = {0, 0, 1, -1};

<span style="color: #8ae234; font-weight: bold;">bool</span> <span style="color: #edd400; font-weight: bold;">safe</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">y</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">x</span>)
{
    <span style="color: #729fcf; font-weight: bold;">return</span> (0&lt;=x &amp;&amp; x &lt; C) &amp;&amp; (0&lt;=y &amp;&amp; y &lt; R);
}

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">bfs_water</span>()
{
    <span style="color: #729fcf; font-weight: bold;">while</span>(!water_q.empty()) {
        <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">cur</span> = water_q.front(); water_q.pop();

        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;4;i++) {
            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ny</span> = cur.y + dy[i];    
            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">nx</span> = cur.x + dx[i];

            <span style="color: #729fcf; font-weight: bold;">if</span> (safe(ny, nx) &amp;&amp; !water[ny][nx] &amp;&amp; map[ny][nx] == <span style="color: #ad7fa8; font-style: italic;">'.'</span>) {
                water[ny][nx] = water[cur.y][cur.x] + 1;
                water_q.push({ny, nx});
            }
        }
    }
}

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">bfs_bebber</span>()
{
    <span style="color: #8ae234; font-weight: bold;">queue</span>&lt;<span style="color: #8ae234; font-weight: bold;">Node</span>&gt; <span style="color: #ff6347;">q</span>;
    q.push(start);

    <span style="color: #729fcf; font-weight: bold;">while</span>(!q.empty()) {
        <span style="color: #8ae234; font-weight: bold;">Node</span> <span style="color: #ff6347;">cur</span> = q.front(); q.pop();

        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;4;i++) {
            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ny</span> = cur.y + dy[i];
            <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">nx</span> = cur.x + dx[i];

            <span style="color: #729fcf; font-weight: bold;">if</span> (safe(ny, nx) &amp;&amp; !bebber[ny][nx] &amp;&amp; (<span style="color: #8ae234; font-weight: bold;">map</span>[ny][nx] == <span style="color: #ad7fa8; font-style: italic;">'.'</span> || map[ny][nx] == <span style="color: #ad7fa8; font-style: italic;">'D'</span>)) {

                <span style="color: #729fcf; font-weight: bold;">if</span> (water[ny][nx] == 0) {
                    bebber[ny][nx] = bebber[cur.y][cur.x] + 1;
                    q.push({ny, nx});
                } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> (water[ny][nx] &gt; bebber[cur.y][cur.x] + 1) {
                    bebber[ny][nx] = bebber[cur.y][cur.x] + 1;
                    q.push({ny, nx});
                }
            } 
        }
    }
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    freopen(<span style="color: #ad7fa8; font-style: italic;">"input4.txt"</span>, <span style="color: #ad7fa8; font-style: italic;">"r"</span>, stdin);
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;R, &amp;C);
    <span style="color: #8ae234; font-weight: bold;">char</span> <span style="color: #ff6347;">str</span>[51];
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;R;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%s"</span>, str);
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=0;str[j];j++) {
            <span style="color: #8ae234; font-weight: bold;">map</span>[i][j] = str[j];
            <span style="color: #729fcf; font-weight: bold;">if</span> (str[j] == <span style="color: #ad7fa8; font-style: italic;">'*'</span>) {
                water_q.push({i,j});        
            } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> (str[j] == <span style="color: #ad7fa8; font-style: italic;">'S'</span>) {
                start.y = i;
                start.x = j;
                <span style="color: #888a85;">//</span><span style="color: #888a85;">printf("i:%d j:%d \n", i, j);</span>
            } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> (str[j] == <span style="color: #ad7fa8; font-style: italic;">'D'</span>) {
                dest.y = i;
                dest.x = j;
            }
        }
    }
    bfs_water();
<span style="color: #729fcf;">#if</span> 0
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;R;i++) {
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=0;j&lt;C;j++) {
            printf(<span style="color: #ad7fa8; font-style: italic;">"%d "</span>, water[i][j]);
        }        
        printf(<span style="color: #ad7fa8; font-style: italic;">"\n"</span>);
    }
<span style="color: #729fcf;">#endif</span>

    bfs_bebber();
<span style="color: #729fcf;">#if</span> 0    
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;R;i++) {
        <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">j</span>=0;j&lt;C;j++) {
            printf(<span style="color: #ad7fa8; font-style: italic;">"%d "</span>, bebber[i][j]);
        }        
        printf(<span style="color: #ad7fa8; font-style: italic;">"\n"</span>);
    }
<span style="color: #729fcf;">#endif</span>    
    <span style="color: #729fcf; font-weight: bold;">if</span> (bebber[dest.y][dest.x] == 0) {
        printf(<span style="color: #ad7fa8; font-style: italic;">"KAKTUS\n"</span>);
    } <span style="color: #729fcf; font-weight: bold;">else</span> {
        printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, bebber[dest.y][dest.x]);
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd5ef4ff" class="outline-2">
<h2 id="orgd5ef4ff">문제 링크</h2>
<div class="outline-text-2" id="text-orgd5ef4ff">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/3055">https://www.acmicpc.net/problem/3055</a></li>
</ul>
</div>
</div>


<div id="outline-container-orgdb8f137" class="outline-2">
<h2 id="orgdb8f137">풀이참고/해설참고</h2>
<div class="outline-text-2" id="text-orgdb8f137">
<ul class="org-ul">
<li><a href="https://yabmoons.tistory.com/66">https://yabmoons.tistory.com/66</a></li>
</ul>
</div>
</div>
